#ifndef _BOND_H_
#define _BOND_H_

#include <ultra64.h>
#include <bondtypes.h>
#include "chr.h"
#include "matrixmath.h"
#include "watch.h"
#include "image.h"

typedef struct invitem_weap
{
	s32 weapon;
} invitem_weap;

typedef struct invitem_prop
{
  PropRecord *prop;
} invitem_prop;

typedef struct invitem_dual
{
	s32 weapon_right;
	s32 weapon_left;
} invitem_dual;

/** unknown struct, used in `strut player`.
 * We know this is a struct from the compiler auto-generated
 * code to copy structs in bondview.c bondviewKillCurrentPlayer.
 * 
 * sizeof == 84 (0x54)
 */
struct collision434 {

    /**
     * Offset 0x00.
     */
    struct StandTile *current_tile_ptr;

    /**
     * Offset 0x04.
     */
    coord3d collision_position;

    /**
     * This affects Bond's movement, but not the viewport.
     * This does not affect boost direction.
     * 
     * f[0]: forward component (sin theta) in radians 
     * f[1]: zero
     * f[2]: sideways component (cos theta) in radians.
     * Offset 0x10.
     */
    struct coord3d theta_transform;

    /**
     * Some kind of alternative to pos3 (in player struct).
     * Offset 0x20.
     */
    coord3d pos3;

    /**
     * Offset 0x2c.
     */
    f32 collision_radius;

    /**
     * Some kind of alternative to pos (in player struct).
     * Offset 0x30.
     */
    coord3d pos;

    /**
     * bondviewMoveAnimationTick calculates 4x4 view matrix transform and then writes rotation
     * to this property and applied_view2. Removing the update to this property will fix
     * Bond's camera orientation such that Bond can still turn, but the camera is always
     * locked facing the starting position.
     * Offset 0x3c.
     */
    struct coord3d applied_view;

    /**
     * Offset 0x48.
     */
    struct coord3d applied_view2;

    /**
     * Offset 0x54.
     */
    StandTile *current_tile_ptr_for_portals;
};

/**
 * first hand: 0x800c6fd0
*/
struct hand
{
  ITEM_IDS weaponnum;
  ITEM_IDS weaponnum_watchmenu;
  ITEM_IDS previous_weapon;

  s8 weapon_firing_status;

  s8 field_87D;
  s8 field_87E;
  s8 field_87F;

  /**
   * Time holding weapon
  */
  s32 weapon_hold_time;
  s32 field_884;
  s32 field_888;
  s32 field_88C;
  s32 field_890;
  s32 when_detonating_mines_is_0;
  s32 weapon_current_animation;
  s32 weapon_ammo_in_magazine;
  s32 field_8A0;
  s32 field_8A4;
  s32 field_8A8;
  s32 weapon_next_weapon;
  s32 field_8B0;
  s32 weapon_animation_trigger;
  s32 field_8B8;
  s32 field_8BC;
  s32 field_8C0;
  s32 field_8C4;
  s32 field_8C8;
  s32 field_8CC;
  s32 field_8D0;
  s32 field_8D4;
  s32 field_8D8;
  s32 field_8DC;
  s32 field_8E0;
  s32 field_8E4;
  s32 field_8E8;
  Mtxf field_8EC;
  s32 field_92C;
  s32 field_930;
  s32 field_934;
  s32 field_938;
  s32 field_93C;
  s32 field_940;
  s32 field_944;
  s32 field_948;
  s32 field_94C;
  s32 field_950;
  s32 field_954;
  s32 field_958;
  s32 field_95C;
  s32 field_960;
  s32 field_964;
  s32 field_968;
  s32 field_96C;
  s32 field_970;
  s32 field_974;
  coord3d blendpos[4];
  coord3d blendlook[4];
  coord3d blendup[4];
  s32 curblendpos;
  f32 dampt;
  f32 blendscale;
  f32 blendscale1;
  s32 sideflag;
  f32 weapon_theta_displacement;
  f32 weapon_verta_displacement;
  s32 field_A24;
  s32 field_A28;
  s32 field_A2C;
  f32 field_A30;
  f32 field_A34;
  f32 field_A38;
  f32 field_A3C;
  f32 field_A40;
  ALSoundState * audioHandle;
  s32 field_A48;
  s32 field_A4C;
  s32 field_A50;
  ChrRecord_f180 field_A54;
  f32 noise;
  f32 field_A84;
  f32 field_A88;
  s32 field_A8C;
  ObjectRecord* rocket;
  s32 firedrocket;
  s32 field_A98;
  s32 field_A9C;
  s32 field_AA0;
  s32 field_AA4;
  s32 field_AA8;
  s32 field_AAC;
  s32 field_AB0;
  s32 field_AB4;
  s32 field_AB8;
  s32 field_ABC;
  s32 field_AC0;
  s32 field_AC4;
  s32 field_AC8;
  s32 field_ACC;
  s32 field_AD0;
  s32 field_AD4;

  // offset 0xad8
  Mtxf throw_item_pos_related;
  
  s32 field_B18;
  s32 field_B1C;
  s32 field_B20;
  s32 field_B24;
  s32 field_B28;
  s32 field_B2C;
  s32 field_B30;
  s32 field_B34;
  s32 field_B38;
  s32 field_B3C;
  s32 field_B40;
  s32 field_B44;
  s32 field_B48;
  s32 field_B4C;
  s32 field_B50;
  s32 field_B54;
  coord3d field_B58;
  f32 field_B64;
  s32 field_B68;
  s32 field_B6C;
  s32 field_B70;
  s32 field_B74;
  s32 field_B78;
  s32 field_B7C;
  s32 field_B80;
  s32 field_B84;
  s32 field_B88;
  s32 field_B8C;
  s32 field_B90;
  s32 field_B94;
  s32 field_B98;
  s32 field_B9C;
  s32 field_BA0;
  s32 field_BA4;
  s32 field_BA8;
  s32 field_BAC;
  s32 field_BB0;
  s32 field_BB4;
  s32 field_BB8;
  s32 field_BBC;
  s32 field_BC0;
  s32 field_BC4;
  s32 field_BC8;
  s32 field_BCC;
  s32 field_BD0;
  s32 field_BD4;
  s32 field_BD8;
  s32 field_BDC;
  s32 field_BE0;
  s32 field_BE4;
  s32 field_BE8;
  s32 field_BEC;
  s32 field_BF0;
  s32 field_BF4;
  s32 field_BF8;
  s32 field_BFC;
  s32 field_C00;
  s32 field_C04;
  s32 volley;  // Number of bullets discharged in a row. For pistols, it's always 1 even if the fire button is held.
  coord3d item_related;
};

typedef struct InvItem {
    s32 type;

    union {
		struct invitem_weap type_weap;
		struct invitem_prop type_prop;
		struct invitem_dual type_dual;

	} type_inv_item;

    struct InvItem *next;
    struct InvItem *prev;

} InvItem;

typedef struct textoverride {

  /*0x00*/ u32 unk1;
	/*0x04*/ s32 objoffset;
	/*0x08*/ s32 weapon;
	/*0x0c*/ u32 unk4;
	/*0x10*/ u32 unk5;
	/*0x14*/ u32 unk6;
	/*0x18*/ u32 unk7;
	/*0x1c*/ u32 pickuptext;
	/*0x20*/ struct textoverride *next;
	/*0x24*/ struct ObjectRecord *obj;
} textoverride;


typedef struct gunheld {
	s32 weapon1;
	s32 weapon2;
	s32 totaltime;
} gunheld;


struct player
{
  /* 0x0000 */ s32 unknown;

  /**
   * Offset 0x0004.
   */
  coord3d pos;

  /**
   * Offset 0x0010.
   */
  coord3d pos2;

  /**
   * Offset 0x001c.
   */
  coord3d offset;

  /**
   * Offset 0x0028.
   */
  coord3d pos3;

  /**
   * Offset 0x0034.
   */
  StandTile *room_pointer;

  /**
   * Offset 0x0038.
   */
  coord3d current_model_pos;

  /**
   * Offset 0x0044.
   */
  coord3d previous_model_pos;

  /**
   * Offset 0x0050.
   */
  coord3d current_room_pos;

  /**
   * Used as parameter to gbi macro.
   * Offset 0x005c.
   */
  s32 field_5C;

  /* 0x0060 */ s32 field_60;
  /* 0x0064 */ s32 field_64;
  /* 0x0068 */ s32 field_68;

  /**
   * Collision / clipping related.
   * Related to y offset.
   * Offset 0x006c.
   */
  /* 0x006c */ f32 field_6C;

  /**
   * Collision / clipping related.
   * Seems to hold save value as stanHeight.
   * Offset 0x0070.
   */
  /* 0x0070 */ f32 field_70;

  /* 0x0074 0x800c67d4 */ f32 stanHeight;

  /* 0x0078 */ f32 field_78;

  /**
   * Collision / clipping related.
   * Used when descending down stairs/ramp.
   * Offset 0x007c.
   */
  /* 0x007c */ f32 field_7C;
  
  /* 0x0080 */ f32 field_80;

  /**
   * Collision / clipping related.
   * Offset 0x0084.
   */
  /* 0x0084 */ f32 field_84;

  /**
   * Collision / clipping related.
   * Offset 0x0088.
   */
  /* 0x0088 */ f32 field_88;

  /**
   * Collision / clipping related.
   * Offset 0x008c.
   */
  /* 0x008c */ s32 field_8C;

  /**
   * Collision / clipping related.
   * When Bond falls off a ladder or similar, will "overshoot" vertical default.
   * Current offset is stored in this field.
   * 
   * Offset 0x0090.
   */
  /* 0x0090 */ f32 vertical_bounce_adjust;
  /* 0x0094 */ s32 field_94;
  /* 0x0098 */ f32 field_98;
  
  /**
   * Flag: 0, 1, 2
  */
  /* 0x009c */ s32 crouchpos;

  /**
   * Varies from 0.0f to -100.0f
   * /
  /* 0x00a0 */ f32 ducking_height_offset;

  /**
   * Crouch related, only used while moving up or down into or
   * out of crouch position.
  */
  /* 0x00a4 */ f32 field_A4;
  /* 0x00a8 */ PropRecord* prop;
  /* 0x00ac */ s32 field_AC;

  /**
   * Offset 0x00b0.
   */
  struct rect4f collision_bounds;

  /* 0x00d0 */ s32 field_D0;
  /* 0x00d4 */ s32 *ptr_char_objectinstance;
  /* 0x00d8 */ s32 bonddead;
  /* 0x00dc */ f32 bondhealth;
  /* 0x00e0 */ f32 bondarmour;
  /* 0x00e4 */ f32 oldhealth;
  /* 0x00e8 */ f32 oldarmour;
  /* 0x00ec */ f32 apparenthealth;
  /* 0x00f0 */ f32 apparentarmour;

#if defined(VERSION_JP) || defined (VERSION_EU)

    /*
    * When a non-negative integer:
    * - hide ammo and aim sight
    * - hide any active speech text
    * - disable shoot and B press interact
    * Otherwise,
    * - undo the above.
    * 0x00f4
    **/
    f32 damageshowtime;
    
    /**
     * When a non-negative integer:
     * - Show health and body armor overlay if Bond isn't dead.
     * Otherwise,
     * - undo the above.
     * 0x00f8
     **/
    f32 healthshowtime;
#else
  /* See comments above. 0x00f4 */ s32 damageshowtime;
  /* See comments above. 0x00f8 */ s32 healthshowtime;
#endif


  /* 0x00fc */ s32 healthshowmode;
  /* 0x0100 */ s32 field_100;
  /* 0x0104 */ s32 field_104;
  /* 0x0108 */ s32 field_108;
  /* 0x010c */ s32 field_10C;
  /* 0x0120 */ s32 movecentrerelease;
  /* 0x0124 */ s32 lookaheadcentreenabled;
  /* 0x0128 */ s32 automovecentreenabled;
  /* 0x012c */ s32 fastmovecentreenabled;
  /* 0x0120 */ s32 automovecentre;

  /**
   * 0: crosshair shown on screen
   * 1: crosshair hidden
   * Only applies in level, when in control of bond.
   * Address 0x800c6884
  */
  /* 0x0124 */ s32 insightaimmode;
  /* 0x0128 */ s32 autoyaimenabled;
  /* 0x012c */ f32 autoaimy;
  /* 0x0130 */ struct PropRecord *autoaim_target_y;
  /* 0x0134 */ s32 autoyaimtime60;
  /* 0x0138 */ s32 autoxaimenabled;
  /* 0x013c */ f32 autoaimx;
  /* 0x0140 */ struct PropRecord *autoaim_target_x;
  /* 0x0144 */ s32 autoxaimtime60;
  /* 0x0148 */ f32 vv_theta;
  /* 0x014c */ f32 speedtheta;
  
  /**
   * Computed value from vv_theta, used to calculate boost direction.
   * 0x0150
   **/
  f32 vv_costheta;
  
  /**
   * Computed value from vv_theta, used to calculate boost direction.
   * 0x0154
   **/
  f32 vv_sintheta;
  
  /**
   * Vertical look angle.
   * 0x0158
   **/
  f32 vv_verta;
  
  /**
   * Vertical look angle. Computed value from vv_verta, should always be between 0 and 360 degrees.
   * 0x015c
   **/
  f32 vv_verta360;

  /* 0x0160 */ f32 speedverta;
  
  /**
   * Computed value from vv_verta360, but otherwise unused?
   * 0x0164
   **/
  f32 vv_cosverta;
  
  /**
   * Computed value from vv_verta360, but otherwise unused?
   * 0x0168
   **/
  f32 vv_sinverta;

  /* 0x016c */ f32 speedsideways;
  /* 0x0170 */ f32 speedstrafe;
  /* 0x0174 */ f32 speedforwards;

  /**
   * Normal run speed: 1.0
   * After 3 seconds of running: 1.35.
   * Address 0x80c68d8
  */
  /* 0x0178 */ f32 speedboost;

  /**
   * How long Bond has been running
  */
  /* 0x017c */ s32 speedmaxtime60;
  
  coord3d bondshotspeed; //0x180

  // offset 0x18c
  f32 bondfadetime60;

  // offset 0x190
  f32 bondfadetimemax60;

  // offset 0x194
  f32 bondfadefracold;

  // offset 0x198
  f32 bondfadefracnew;

  // offset 0x19c
  f32 bondbreathing;
  
  s32 field_1A0;
  s32 field_1A4;
  s32 field_1A8;
  s32 field_1AC;
  s32 field_1B0;
  s32 field_1B4;
  s32 field_1B8;
  s32 field_1BC;

  /**
   * Current pause time.
   * Resets after every new pause.
   * Address 0x800c6920
  */
  s32 watch_pause_time;

  s32 field_1C4;
  s32 watch_animation_state;

  /**
   * 1 = level is active
   * 0 = game is paused
   * Changes to zero only after fully entering watch.
   * Address 0x800c692c
  */
  s32 outside_watch_menu;
  s32 open_close_solo_watch_menu;
  f32 field_1D4;
  f32 field_1D8;
  f32 pause_watch_position;
  f32 field_1E0;
  f32 field_1E4;
  f32 field_1E8;
  f32 field_1EC;
  f32 field_1F0;
  f32 field_1F4;
  s32 field_1F8;
  s32 field_1FC;
  /**
   * Pausing flag.
   * 0 = level is active
   * 1 = begin pause animation. Set as soon as moving arm begins, cleared when moving arm ends.
   * 0x800C6960
  */
  s32 pausing_flag;
  f32 pause_starting_angle;
  f32 pause_related;
  f32 pause_target_angle;
  f32 field_210;
  f32 field_214;
  s32 field_218;
  s32 field_21C;
  s32 step_in_view_watch_animation;
  f32 pause_animation_counter;

  /**
   * Offset 0x0228.
   */
  f32 pause_watch_related;

  /**
   * Looks to be same as pause_watch_related, but adjusted by scale factor.
   * Offset 0x022c.
   */
  f32 pause_watch_related_scaled;
  
  s32 something_with_watch_object_instance;

  s32 field_234;
  s32 field_238;
  s32 field_23C;
  s32 field_240;
  s32 watch_scale_destination;
  s32 field_248;
  s32 field_24C;
  s32 field_250;
  s32 field_254;

  /**
   * Some kind of adjustment applied before scaling to set pause_watch_related_scaled.
   * Offset 0x0258.
   */
  f32 pause_watch_related_adjust;
  s32 field_25C;
  s32 field_260;
  s32 field_264;
  s32 field_268;
  s32 field_26C;
  s32 field_270;
  s32 field_274;
  s32 field_278;
  s32 field_27C;
  s32 field_280;
  s32 field_284;
  s32 field_288;
  s32 field_28C;
  s32 field_290;
  s32 field_294;
  s32 field_298;
  s32 field_29C;
  s32 field_2A0;
  s32 field_2A4;
  s32 field_2A8;
  s32 field_2AC;
  s32 field_2B0;
  s32 field_2B4;
  s32 field_2B8;
  s32 field_2BC;
  s32 field_2C0;
  s32 field_2C4;
  s32 field_2C8;
  s32 field_2CC;
  s32 field_2D0;
  s32 field_2D4;
  s32 field_2D8;
  s32 field_2DC;
  s32 field_2E0;
  s32 field_2E4;
  s32 field_2E8;
  s32 field_2EC;
  s32 field_2F0;
  s32 field_2F4;
  s32 field_2F8;
  s32 field_2FC;
  s32 field_300;
  s32 field_304;
  s32 field_308;
  s32 field_30C;
  s32 field_310;
  s32 field_314;
  s32 field_318;
  s32 field_31C;
  s32 field_320;
  s32 field_324;
  s32 field_328;
  s32 field_32C;
  s32 field_330;
  s32 field_334;
  s32 field_338;
  s32 field_33C;
  s32 field_340;
  s32 field_344;
  s32 field_348;
  s32 field_34C;
  s32 field_350;
  s32 field_354;
  s32 field_358;
  s32 field_35C;
  s32 field_360;
  s32 field_364;
  s32 field_368;
  s32 field_36C;
  s32 field_370;
  s32 field_374;
  s32 field_378;
  s32 field_37C;
  s32 field_380;
  s32 field_384;
  s32 field_388;
  s32 field_38C;
  s32 field_390;
  s32 field_394;
  s32 field_398;
  s32 field_39C;
  s32 field_3A0;
  s32 field_3A4;
  s32 field_3A8;
  s32 field_3AC;
  s32 field_3B0;

  /**
   * Copy of buttons pressed.
   * Address 0x800C6B17
  */
  u16 buttons_pressed;
  u16 prev_buttons_pressed;

  struct coord3d field_3B8;

  f32 field_3C4;
  f32 field_3C8;
  f32 field_3CC;
  s32 colourscreenred;
  s32 colourscreengreen;
  s32 colourscreenblue;
  f32 colourscreenfrac;
  f32 colourfadetime60;

  /**
   * Offset 0x3e4.
   */
  f32 colourfadetimemax60;
  s32 colourfaderedold;
  s32 colourfaderednew;
  s32 colourfadegreenold;
  s32 colourfadegreennew;
  s32 colourfadeblueold;
  s32 colourfadebluenew;
  f32 colourfadefracold;
  f32 colourfadefracnew;

  /*
  * Something with position, like previous x position.
  * Offset 0x408.
  */
  coord3d bondprevpos; //0x408
  
  f32 thetadie; //0x414
  f32 vertadie; //0x418
  s32 bondtype; 
  s32 startnewbonddie; //0x420

  /**
   * Multiplayer related.
   * Offset 0x424.
   */
  s32 redbloodfinished;

  /**
   * Multiplayer related.
   * Offset 0x428.
   */
  s32 deathanimfinished;
  s32 field_42c;
  s32 controldef; //0x430

  struct collision434 previous_collision_info;
  struct collision434 field_488;

  s32 resetheadpos; // bool
  s32 resetheadrot; // bool
  s32 resetheadtick; // bool 0x4e4

  s32 headanim; // index into array of pointers. Pointers are for animations.

  // has NTSC<->PAL difference, but not (5/6)
  f32 headdamp;
  s32 headwalkingtime60; //0x4f0
  f32 headamplitude; //0x4f4
  f32 sideamplitude; //0x4f8
  struct coord3d headpos;
  struct coord3d headlook;

  struct coord3d headup;
  struct coord3d headpossum;

  // headlooksum[2] has NTSC->PAL conversion rate (5/6)
  struct coord3d headlooksum;

  // headupsum[1] has NTSC->PAL conversion rate (5/6)
  struct coord3d headupsum;
  struct coord3d headbodyoffset; //0x544
  f32 standheight; // old name stationary_ground_offset

  // f32[4] ?? or 2 x f32[2] ??
  coord3d standbodyoffset; //0x554
  f32 standfrac; //0x560

  // offset 0x564
  struct coord3d standlook[2];

  // offset 0x57C
  struct coord3d standup[2];

  // offset 0x594
  s32 standcnt;
  Model *model;
  s32 field_59C;
  s32 field_5A0;
  s32 field_5A4;
  s32 field_5A8;
  s32 field_5AC;
  s32 field_5B0;
  s32 field_5B4;
  s32 field_5B8;
  s8 field_5BC;
  s8 field_5BD;
  s8 field_5BE;
  s8 field_5BF;
  
  f32 field_5C0;

  s32 field_5C4;
  s32 field_5C8;
  s32 field_5CC;
  s32 field_5D0;
  s32 field_5D4;
  s32 field_5D8;
  s32 field_5DC;
  s32 field_5E0;
  s32 field_5E4;
  s32 field_5E8;
  s32 field_5EC;
  s32 field_5F0;
  s32 field_5F4;
  s32 field_5F8;
  s32 field_5FC;
  s32 field_600;
  s32 field_604;
  s32 field_608;
  s32 field_60C;
  s32 field_610;
  s32 field_614;
  s32 field_618;
  s32 field_61C;
  s32 field_620;
  s32 field_624;
  s32 field_628;
  s32 field_62C;
  s32 field_630;
  s32 field_634;
  s32 field_638;
  s32 field_63C;
  s32 field_640;
  s32 field_644;
  s32 field_648;
  s32 field_64C;
  s32 field_650;
  s32 field_654;
  s32 field_658;
  s32 field_65C;
  s32 field_660;
  s32 field_664;
  s32 field_668;
  s32 field_66C;
  s32 field_670;
  s32 field_674;
  s32 field_678;
  s32 field_67C;
  s32 field_680;
  s32 field_684;
  s32 field_688;
  s32 field_68C;
  s32 field_690;
  s32 field_694;
  s32 field_698;
  s32 field_69C;
  s32 field_6A0;
  s32 field_6A4;
  s32 field_6A8;
  s32 field_6AC;
  s32 field_6B0;
  s32 field_6B4;
  s32 field_6B8;
  s32 field_6BC;
  s32 field_6C0;
  s32 field_6C4;
  s32 field_6C8;
  s32 field_6CC;

  Mtxf bondheadmatrices[4];

  Vp viewports[2];

  /**
   * Offset 0x7f0.
   */
  s16 viewx;

  /**
   * Offset 0x7f2.
   */
  s16 viewy;

  /**
   * Offset 0x7f4.
   */
  s16 viewleft;

  /**
   * Offset 0x7f6.
   */
  s16 viewtop;
  
  s32 hand_invisible[2]; /* 0x7f8*/
  ITEM_IDS hand_item[2]; /* 0x800 */
  ModelFileHeader *ptr_hand_weapon_buffer[2]; /* 0x808 */
  
  /**
   * Offset 0x810.
   */
  ModelFileHeader copy_of_body_obj_header[2];
  
  struct texpool item_related[2]; /* 0x850 */

  /**
   * Offset 0x870.
   */
  struct hand hands[2];
  f32 gunposamplitude;
  f32 gunxamplitude;
  s32 field_FC8;

  /**
   * Used in lvlRender method, in VERSION_JP build.
   * Set to one when holding a grenade (primed to explode).
   * Offset 0xfcc.
   */
  s32 field_FCC;
  
  // Seems to be copy of field_FCC
  s32 field_FD0;

  s32 z_trigger_timer;
  s32 field_FD8;
  struct rgba_u8 tileColor;
  s32 resetshadecol;

  // unused. Name comes from XBLA debug.
  s32 aimtype;

  /**
   * Crosshair or bullet angle related.
   * Offset 0xfe8.
  */
  coord2d crosshair_angle;
  f32 crosshair_x_pos;
  f32 crosshair_y_pos;
  f32 guncrossdamp;
  coord2d field_FFC;
  f32 gun_azimuth_angle;
  f32 gun_azimuth_turning;
  f32 gunaimdamp;
  coord3d field_1010;
  Mtxf field_101C;
  s32 last_z_trigger_timer;
  s32 copiedgoldeneye;
  s32 gunammooff;
  s32 field_1068;
  f32 gunsync;
  f32 syncchange;
  f32 synccount;
  s32 syncoffset;
  f32 field_107C;
